grocery_list/app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
      if @list.save
---
INSERT INTO "lists" ("created_at", "updated_at", "item", "brand", "store", "price") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-02-13 16:34:40.538101"], ["updated_at", "2018-02-13 16:34:40.538101"], ["item", "Coffee"], ["brand", "Folgers"], ["store", "NYC Fresh"], ["price", 6.99]]

  def update
    @list = List.find(params[:id])
    if @list.update_attributes(cat_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "lists" SET "store" = ?, "price" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["store", "Westside Market"], ["price", 4.99], ["updated_at", "2018-02-14 03:14:32.780504"], ["id", 14]]